tap "chroju/tap"
tap "homebrew/bundle"
tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Garbage collector for C and C++
brew "bdw-gc"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Bash completion for Bundler
brew "bundler-completion"
# Asynchronous DNS library
brew "c-ares"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Manage compile and link flags for libraries
brew "pkg-config"
# GNU multiple precision arithmetic library
brew "gmp"
# Asynchronous event library
brew "libevent"
# C string library for manipulating Unicode strings
brew "libunistring"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# GNU Emacs text editor
brew "emacs", restart_service: true
# Emacs dependency management
brew "cask"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Command-line utility for uploading Gists
brew "gist"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# Library for command-line editing
brew "readline"
# Alternative to top/htop
brew "glances"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Macro processing language
brew "m4"
# Generic library support script
brew "libtool"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Improved top (interactive process viewer)
brew "htop"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Asynchronous event library
brew "libev"
# Portable Foreign Function Interface library
brew "libffi"
# Friendly wrapper for launchctl
brew "lunchy"
# Mac App Store command-line interface
brew "mas"
# Modern and intuitive terminal-based text editor
brew "micro"
# Fast, highly customisable system info script
brew "neofetch"
# HTTP/2 C Library
brew "nghttp2"
# Development kit for the Java programming language
brew "openjdk"
# Highly capable, feature-rich programming language
brew "perl"
# Command-line YAML and XML processor that wraps jq
brew "python-yq"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Stand alone ad blocker
cask "adguard"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Android SDK component
cask "android-platform-tools"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Fujitsu ScanSnap Scanner software
cask "fujitsu-scansnap-home"
# Client for the Google Drive storage service
cask "google-drive"
# Japanese input software
cask "google-japanese-ime"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Word processor
cask "microsoft-word"
# Video game digital distribution service
cask "steam"
# Customizable email client
cask "thunderbird"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Network protocol analyzer
cask "wireshark"
# Video communication and virtual meeting platform
cask "zoom"
mas "Apple Configurator", id: 1037126344
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "LanScan", id: 472226235
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "MARKETSPEED", id: 946680495
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "RunCat", id: 1429033973
mas "Tailscale", id: 1475387142
mas "Twitter", id: 1482454543
mas "Xcode", id: 497799835
vscode "atlassian.atlascode"
vscode "cocopon.iceberg-theme"
vscode "codezombiech.gitignore"
vscode "DavidAnson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.vscode-mysql"
vscode "leodevbro.blockman"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.powershell"
vscode "Oracle.oracledevtools"
vscode "PKief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "yzhang.markdown-all-in-one"
