tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# Bash completion for Bundler
brew "bundler-completion"
# GNU Emacs text editor
brew "emacs", restart_service: true
# Emacs dependency management
brew "cask"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GitHub command-line tool
brew "gh"
# Improved top (interactive process viewer)
brew "htop"
# Friendly wrapper for launchctl
brew "lunchy"
# Mac App Store command-line interface
brew "mas"
# Command-line YAML and XML processor that wraps jq
brew "python-yq"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Stand alone ad blocker
cask "adguard"
# Android SDK component
cask "android-platform-tools"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Client for the Dropbox cloud storage service
cask "dropbox"
cask "emacs"
# Interface for reading and syncing eBooks
cask "kindle"
# Graphical client for Git version control
cask "sourcetree"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
